[
  {
    "Name": "Grading System for TA's",
    "Github": "https://github.com/Lazarus1993/Grading_System",
    "Date": "Oct 2017 - Dec 2017",
    "Demo": "https://www.youtube.com/watch?v=ES5dahGFt28",
    "Description": "The project involves creating a grading interface for Teaching Assistants to check the coding assignments that students submit."
  },
  {
    "Name": "HealthShare",
    "Github": "https://github.com/Lazarus1993/infsci-2620-final",
    "Date": "Oct 2018 - Dec 2018",
    "Demo": "https://infsci-2620-final.herokuapp.com",
    "Description": "This application is a platform for health professionals to share experience and knowledge with their peers. We implemented a ton of security features including re-CAPTCHA, Two Factor Authentication using DUO and RBAC."
  },
  {
    "Name": "Pedia Trials",
    "Github": "https://github.com/Lazarus1993/Project_Blind_Mice",
    "Date": "Oct 2018 - Present",
    "Demo": "https://project-blind-mice.herokuapp.com",
    "Description": "Developed a portal for patients and doctors for clinical trials. Each patient will receive a custom feed of trials that match the requirements of the trials and the patients own eligibility. Data needs to pulled from EPIC and clinicaltrials.gov(In Progress) for now I am using dummy data. Technology used is MongoDB for NoSQL database, Express, React for frontend, NodeJS for backend, Twitter Bootstrap 4 for CSS, Redux for State management, Font Awesome and Heroku for hosting website."
  },
  {
    "Name": "The Food Network",
    "Date": "Sep 2018 - Present",
    "Description": "I am currently working on an ambitious project, to make a social network for foodies and restaurant owners. The web application would let foodies review their favorite restaurants and owners to view the public opinion that their restaurant have in real time. I plan to use sentiment analysis on each review to determine whether its positive, negative or neutral. I plan to create a network of foodies with their very own post/comment feeds. For Data Visualization, I plan to use Word Clouds, Histograms and other graphs. The technology I plan to use is the MERN stack."
  },
  {
    "Name": "Code Rash",
    "Date": "Oct 2017 - Dec 2017",
    "Description": "The project is to create an application/game that allows a set of players to participate. The players have to solve a set of programming questions given by the judge within a timeframe. At the end of the timer the judge compares the output generated by the code of the 2 players and declares a winner."
  }
]
